#天気コードの一覧
WEATHER_MAP = {
    # 晴れ系
    "100": "晴れ",
    "101": "晴れ時々曇り",
    "102": "晴れ一時雨",
    "111": "晴れ後曇り",
    "112": "晴れ後雨",

    # 曇り系
    "200": "曇り",
    "201": "曇り時々晴れ",
    "202": "曇り一時雨",
    "203": "曇り時々雨",
    "204": "曇り一時雪",
    "210": "曇後時々晴",
    "211": "曇後晴",
    "212": "曇り後雨",

    # 雨系
    "300": "雨",
    "301": "雨時々晴れ",
    "303": "雨時々曇り",
    "306": "大雨",
    "308": "暴風雨",
    "313": "雨後曇り",

    # 雪系
    "400": "雪",
    "401": "雪時々晴れ",
    "402": "雪時々曇り",
    "403": "雪一時雨",
    "406": "雪後雨",

    # その他
    "500": "みぞれ",
    "502": "雷",
    "508": "吹雪",
    "900": "天気不明"
}

#天気アイコン画像
WEATHER_ICON = {                    
    "雨": "rain.png",                
    "雨時々晴れ": "rain_partly_sunny.png",
    "雨時々曇り":"rain_partly_cloudy.png",
    "晴れ": "sunny.png",               
    "晴れ後雨": "sunny_partly_rain.png",   
    "晴れ時々曇り": "sunny_partly_cloudy.png", 
    "雪": "snow.png", 
    "雪時々晴れ":"snow_partly_sunny.png",
    "雪時々曇り":"snow_partly_cloudy.png",
    "雪時々雨":"snow_partly_rain.png",               
    "曇り": "cloudy.png",              
    "曇り時々雨": "cloudy_partly_rain.png",  
    "曇り時々晴れ": "cloudy_partly_sunny.png", 
    "雷": "thunder.png",
    "天気不明": "unknown.png"     

}

# 画像取得用で正規化した天気
WEATHER_NORMALIZE = {
    "晴れ後曇り": "晴れ時々曇り",
    "晴れ一時雨": "晴れ後雨",
    "曇後時々晴": "曇り時々晴れ",
    "曇後晴": "曇り時々晴れ",
    "曇り一時雨":"曇り時々雨",
    "曇り後雨":"曇り時々雨",
    "大雨":"雨",
    "雨後曇り":"雨時々曇り",
    "暴風雨":"雨",
    "雪一時雨":"雪時々雨",
    "雪後雨":"雪時々雨",
    "みぞれ":"雪",
    "吹雪":"雪"
}